randomize();
a = "史诗灵魂" num = 4;
var b = irandom_range(1,46)

if (b == 1) {a = "维利的预言"; num = 5;}
if (b == 2) {a = "屠戮者的镣铐"; num = 6;}
if (b == 3) {a = "毁灭之眼"; num = 4;}
if (b == 4) {a = "半巨人之怒"; num = 5;}
if (b == 5) {a = "艾拉斯的轨迹"; num = 6;}
if (b == 6) {a = "维斯特卢"; num = 4;}
if (b == 7) {a = "银河之星"; num = 4;}
if (b == 8) {a = "永恒战术"; num = 4;}
if (b == 9) {a = "倾塌之墙"; num = 4;}
if (b == 10) {a = "斯洛特的原初之力"; num = 8;}
if (b == 11) {a = "诺萨的灵魂挽歌"; num = 7;}
if (b == 12) {a = "崇高的幻象"; num = 5;}
if (b == 13) {a = "时轮驾驭者"; num = 5;}
if (b == 14) {a = "半巨人的背叛"; num = 6;}
if (b == 15) {a = "巨龙之怒-星空的征服者"; num = 11;}

if (b == 16) {a = "米斯蒂娅的歌声"; num = 7;}
if (b == 17) {a = "浮光花园"; num = 4;}
if (b == 18) {a = "精灵天舞"; num = 4;}
if (b == 19) {a = "伊贝拉的梦境"; num = 6;}
if (b == 20) {a = "幸运的白兔"; num = 5;}
if (b == 21) {a = "精灵之翼"; num = 4;}
if (b == 22) {a = "松之礼赞"; num = 4;}
if (b == 23) {a = "夏夜星象馆"; num = 5;}
if (b == 24) {a = "月光漫步"; num = 4;}
if (b == 25) {a = "圣路易斯的轨迹"; num = 7;}
if (b == 26) {a = "英雄王的象征"; num = 6;}
if (b == 27) {a = "幻想的狐嫁雨"; num = 6;}
if (b == 28) {a = "怜月的约定"; num = 5;}
if (b == 29) {a = "不动的大图书馆"; num = 7;}
if (b == 30) {a = "艾露尼斯"; num = 4;}
if (b == 31) {a = "杰米尼-冥影之霍德尔"; num = 9;}
if (b == 32) {a = "艾因斯贝伦的诞生之芽"; num = 10;}

if (b == 33) {a = "雄鹰之心"; num = 4;}
if (b == 34) {a = "希望的回响"; num = 5;}
if (b == 35) {a = "萨瓦里克的杰作"; num = 7;}
if (b == 36) {a = "超时空护腕"; num = 5;}
if (b == 37) {a = "死亡之拥"; num = 4;}
if (b == 38) {a = "永恒梦境"; num = 4;}
if (b == 39) {a = "燃烧的地狱核心"; num = 7;}
if (b == 40) {a = "法术理论"; num = 4;}
if (b == 41) {a = "狂风骤雨"; num = 4;}
if (b == 42) {a = "云中漫步  "; num = 4;}
if (b == 43) {a = "思维火花"; num = 4;}
if (b == 44) {a = "记忆支配者"; num = 5;}
if (b == 45) {a = "创世者柱石"; num = 5;}
if (b == 46) {a = "空间加速器"; num = 5;}




/*
var qq = irandom_range(1,3354);
if (qq <= 1050)
{
var b = irandom_range(1,70)
if (b == 1) {a = "天魔之爪-怒风"; num = 7;}
if (b == 2) {a = "千鸟-雷切"; num = 5;}
if (b == 3) {a = "弹幕之雨"; num = 4;}
if (b == 4) {a = "巨神之父"; num = 4;}
if (b == 5) {a = "智者千虑"; num = 4;}
if (b == 6) {a = "别云剑-无用"; num = 6;}
if (b == 7) {a = "神之天佑"; num = 4;}
if (b == 8) {a = "御魂-七支刀"; num = 6;}
if (b == 9) {a = "浣熊吸尘器"; num = 5;}
if (b == 10) {a = "星云幻"; num = 3;}
if (b == 11) {a = "阴剑-莫邪"; num = 5;}
if (b == 12) {a = "大智度论"; num = 4;}
if (b == 13) {a = "亚巴顿的尖啸"; num = 6;}
if (b == 14) {a = "冰火之莲"; num = 4;}
if (b == 15) {a = "拇指规则 MBA"; num = 7;}
if (b == 16) {a = "阳剑-干将"; num = 5;}
if (b == 17) {a = "米斯特汀"; num = 4;}
if (b == 18) {a = "无轩之黄金念珠"; num = 7;}
if (b == 19) {a = "黑暗禁咒"; num = 4;}
if (b == 20) {a = "炫纹大师"; num = 4;}
if (b == 21) {a = "雷剑-苦轮"; num = 5;}
if (b == 22) {a = "双子物语"; num = 4;}
if (b == 23) {a = "无轩之黄金手炮"; num = 7;}
if (b == 24) {a = "银魂"; num = 3;}
if (b == 25) {a = "疾虎之力"; num = 4;}
if (b == 26) {a = "贤者之杖"; num = 4;}
if (b == 27) {a = "死亡宣告-契约之镰"; num = 9;}
if (b == 28) {a = "战神之怒"; num = 4;}
if (b == 29) {a = "小霸王-其乐无穷"; num = 8;}
if (b == 30) {a = "铁脊蛇矛"; num = 4;}
if (b == 31) {a = "被诅咒的十字架-图卢瓦"; num = 11;}
if (b == 32) {a = "聚金雕翎"; num = 4;}
if (b == 33) {a = "胜利女神之矛"; num = 6;}
if (b == 34) {a = "拳风传奇"; num = 4;}
if (b == 35) {a = "全面开战-总攻"; num = 7;}
if (b == 36) {a = "神隐者"; num = 3;}
if (b == 37) {a = "火遁秘刃：爆炎"; num = 7;}
if (b == 38) {a = "卑劣的肾击者"; num = 6;}
if (b == 39) {a = "最高指挥官战弩"; num = 7;}
if (b == 40) {a = "神秘代号 608"; num = 7;}
if (b == 41) {a = "名刀-观世正宗"; num = 7;}
if (b == 42) {a = "螺旋丸"; num = 3;}
if (b == 43) {a = "精灵王的庇护"; num = 5;}
if (b == 44) {a = "末世双剑"; num = 4;}
if (b == 45) {a = "生死轮盘-玩命"; num = 7;}
if (b == 46) {a = "无轩之黄金东方棍"; num = 8;}
if (b == 47) {a = "三一真神"; num = 4;}
if (b == 48) {a = "梁月的钝剑"; num = 5;}
if (b == 49) {a = "未完成的研发者臂铠"; num = 9;}
if (b == 50) {a = "小美人鱼的苍蝇拍"; num = 8;}
if (b == 51) {a = "六十之轮回"; num = 5;}
if (b == 52) {a = "雪落千寒"; num = 4;}
if (b == 53) {a = "异魔封神扫把"; num = 6;}
if (b == 54) {a = "耀光女王的银妆刀"; num = 8;}
if (b == 55) {a = "利齿：大白鲨"; num = 6;}
if (b == 56) {a = "禁灭之锥"; num = 4;}
if (b == 57) {a = "牧童之谎-狼来了"; num = 8;}
if (b == 58) {a = "漫游之王"; num = 4;}
if (b == 59) {a = "极光狂热者"; num = 5;}
if (b == 60) {a = "黑暗绝魂之杖"; num = 6;}
if (b == 61) {a = "蛛王权杖"; num = 4;}
if (b == 62) {a = "青月令"; num = 3;}
if (b == 63) {a = "方天画戟"; num = 4;}
if (b == 64) {a = "未完成的研发者之矛"; num = 8;}
if (b == 65) {a = "青龙偃月刀"; num = 5;}
if (b == 66) {a = "爱之闪耀魔法少女棒"; num = 9;}
if (b == 67) {a = "逆天命-无归";num = 6;}
if (b == 68) {a = "风涌雷萨图腾";num = 6;}
if (b == 69) {a = "巴鲁姆克之剑";num = 6;}
if (b == 70) {a = "天从云";num = 3;}
}
if (qq > 1050 && qq <= 1800)
{
var b = irandom_range(1,50)
if (b == 1) {a = "最佳球手的暴走战衣"; num = 9;}
if (b == 2) {a = "最佳球手的冲锋腰带"; num = 9;}
if (b == 3) {a = "最佳球手的反击护具"; num = 9;}
if (b == 4) {a = "最佳球手的奇袭长裤"; num = 9;}
if (b == 5) {a = "最佳球手的逆袭跑鞋"; num = 9;}
if (b == 6) {a = "霸域英豪战靴"; num = 6;}
if (b == 7) {a = "霸域英豪腰带"; num = 6;}
if (b == 8) {a = "霸域英豪护腿"; num = 6;}
if (b == 9) {a = "霸域英豪胸甲"; num = 6;}
if (b == 10) {a = "霸域英豪护肩"; num = 6;}
if (b == 11) {a = "逝魔之暴烈长裤"; num = 7;}
if (b == 12) {a = "逝魔之灵悟肩甲"; num = 7;}
if (b == 13) {a = "逝魔之风速短靴"; num = 7;}
if (b == 14) {a = "逝魔之灵心腰带"; num = 7;}
if (b == 15) {a = "逝魔之疾咒长袍"; num = 7;}
if (b == 16) {a = "闲云碎步短靴"; num = 6;}
if (b == 17) {a = "暗殇绝影腰带"; num = 6;}
if (b == 18) {a = "火陨灭炎长裤"; num = 6;}
if (b == 19) {a = "蚀日无辉肩甲"; num = 6;}
if (b == 20) {a = "风霜雪影长袍"; num = 6;}
if (b == 21) {a = "暗魅之影上衣"; num = 6;}
if (b == 22) {a = "亡灵之帐腰带"; num = 6;}
if (b == 23) {a = "血舞之牙护腿"; num = 6;}
if (b == 24) {a = "冥殇之刃肩甲"; num = 6;}
if (b == 25) {a = "黄泉之风战靴"; num = 6;}
if (b == 26) {a = "战术之王的御敌胸甲"; num = 9;}
if (b == 27) {a = "战术之王的御敌腰带"; num = 9;}
if (b == 28) {a = "战术之王的御敌腿甲"; num = 9;}
if (b == 29) {a = "战术之王的御敌肩甲"; num = 9;}
if (b == 30) {a = "战术之王的御敌长靴"; num = 9;}
if (b == 31) {a = "天御雷罚战甲"; num = 6;}
if (b == 32) {a = "天御凝霜腰带"; num = 6;}
if (b == 33) {a = "天御炎袭护腿"; num = 6;}
if (b == 34) {a = "天御虫噬护肩"; num = 6;}
if (b == 35) {a = "天御风行战靴"; num = 6;}
if (b == 36) {a = "千蛛碎影之毒牙胸甲"; num = 9;}
if (b == 37) {a = "千蛛碎影之蛛刺腰带"; num = 9;}
if (b == 38) {a = "千蛛碎影之蛛网护腿"; num = 9;}
if (b == 39) {a = "千蛛碎影之蛛丝肩甲"; num = 9;}
if (b == 40) {a = "千蛛碎影之利齿战靴"; num = 9;}
if (b == 41) {a = "誓血之盟铠甲"; num = 6;}
if (b == 42) {a = "誓血之盟腰带"; num = 6;}
if (b == 43) {a = "誓血之盟腿甲"; num = 6;}
if (b == 44) {a = "誓血之盟肩甲"; num = 6;}
if (b == 45) {a = "誓血之盟战靴"; num = 6;}
if (b == 46) {a = "魔战无双胸甲"; num = 6;}
if (b == 47) {a = "魔战无双腰带"; num = 6;}
if (b == 48) {a = "魔战无双腿甲"; num = 6;}
if (b == 49) {a = "魔战无双肩甲"; num = 6;}
if (b == 50) {a = "魔战无双短靴"; num = 6;}
}
if (qq > 1800 && qq <= 1965)
{
var b = irandom_range(1,11)
if (b == 1) {a = "冰雪公主的霜语项链"; num = 9;}
if (b == 2) {a = "冰雪公主的霜语戒指"; num = 9;}
if (b == 3) {a = "冰雪公主的霜语手镯"; num = 9;}
if (b == 4) {a = "精炼的混沌魔石项链"; num = 9;}
if (b == 5) {a = "精炼的遗忘魔石戒指"; num = 9;}
if (b == 6) {a = "精炼的毁伤魔石手环"; num = 9;}
if (b == 7) {a = "刀锋女王的铁血项链"; num = 9;}
if (b == 8) {a = "焚天祭手环"; num = 5;}
if (b == 9) {a = "暗杀者的锋芒戒指"; num = 8;}
if (b == 10) {a = "被囚者的染血手铐"; num = 8;}
if (b == 11) {a = "执行者的刺杀项链"; num = 8;}
}
if (qq > 1965 && qq <= 1998)
{
var b = irandom_range(1,3)
if (b == 1) {a = "空城泪-旧王仇"; num = 7;}
if (b == 2) {a = "名将之兵书"; num = 5;}
if (b == 3) {a = "时空旅行者的随身怀表"; num = 10;}
}
if (qq > 1998 && qq <= 2598)
{
var b = irandom_range(1,50)
if (b == 1) {a = "上元节丝绸护肩"; num = 7;}
if (b == 2) {a = "上元节五彩上衣"; num = 7;}
if (b == 3) {a = "上元节朴素腰带"; num = 7;}
if (b == 4) {a = "上元节之绣花鞋"; num = 7;}
if (b == 5) {a = "上元节贴边长裙"; num = 7;}
if (b == 6) {a = "真丝诱惑腰带"; num = 6;}
if (b == 7) {a = "琉璃丝绸护肩"; num = 6;}
if (b == 8) {a = "凝聚光芒长袍"; num = 6;}
if (b == 9) {a = "永恒蔑视长靴"; num = 6;}
if (b == 10) {a = "隐匿无形护肩"; num = 6;}
if (b == 11) {a = "时光的轨迹肩甲"; num = 7;}
if (b == 12) {a = "时光的轨迹长靴"; num = 7;}
if (b == 13) {a = "时光的轨迹腰带"; num = 7;}
if (b == 14) {a = "时光的轨迹夹克"; num = 7;}
if (b == 15) {a = "时光的轨迹长裤"; num = 7;}
if (b == 16) {a = "织梦龙鳞腰带"; num = 6;}
if (b == 17) {a = "航海追梦者护腿"; num = 7;}
if (b == 18) {a = "至高统帅的战争指令"; num = 9;}
if (b == 19) {a = "怒牙战歌夹克"; num = 6;}
if (b == 20) {a = "苍穹碧落长靴"; num = 6;}
if (b == 21) {a = "万世荣光战靴"; num = 6;}
if (b == 22) {a = "万世荣光上衣"; num = 6;}
if (b == 23) {a = "万世荣光腰带"; num = 6;}
if (b == 24) {a = "万世荣光肩甲"; num = 6;}
if (b == 25) {a = "万世荣光护腿"; num = 6;}
if (b == 26) {a = "战术跃迁护腿"; num = 6;}
if (b == 27) {a = "暮色审判长靴"; num = 6;}
if (b == 28) {a = "无尽意志肩甲"; num = 6;}
if (b == 29) {a = "命运驾驭胸甲"; num = 6;}
if (b == 30) {a = "狂风骤雨腰带"; num = 6;}
if (b == 31) {a = "铁马长戈胸甲"; num = 6;}
if (b == 32) {a = "铁马长戈肩甲"; num = 6;}
if (b == 33) {a = "铁马长戈护腿"; num = 6;}
if (b == 34) {a = "铁马长戈战靴"; num = 6;}
if (b == 35) {a = "铁马长戈腰带"; num = 6;}
if (b == 36) {a = "至高统帅的熔火战靴"; num = 9;}
if (b == 37) {a = "禁忌之影护腿"; num = 6;}
if (b == 38) {a = "禁忌深渊肩甲"; num = 6;}
if (b == 39) {a = "禁忌之痕腰带"; num = 6;}
if (b == 40) {a = "至高统帅的战火胸甲"; num = 9;}
if (b == 41) {a = "星辰之命运战靴"; num = 7;}
if (b == 42) {a = "星辰之命运护肩"; num = 7;}
if (b == 43) {a = "星辰之命运腰带"; num = 7;}
if (b == 44) {a = "星辰之命运护腿"; num = 7;}
if (b == 45) {a = "星辰之命运胸甲"; num = 7;}
if (b == 46) {a = "迷幻之雾琥珀护肩"; num = 8;}
if (b == 47) {a = "迷幻之心青金战靴"; num = 8;}
if (b == 48) {a = "迷幻之灵琉璃腰带"; num = 8;}
if (b == 49) {a = "迷幻之影宝石护腿"; num = 8;}
if (b == 50) {a = "迷幻之魂珊瑚战甲"; num = 8;}
}
if (qq > 2598 && qq <= 3064)
{
var b = irandom_range(1,32)
if (b == 1) {a = "地狱浩劫"; num = 4;}
if (b == 2) {a = "暗影蔽日"; num = 4;}
if (b == 3) {a = "死亡冰柱"; num = 4;}
if (b == 4) {a = "圣剑-王者之剑"; num = 7;}
if (b == 5) {a = "世界的支点"; num = 5;}
if (b == 6) {a = "金色闪光"; num = 4;}
if (b == 7) {a = "宇宙真理"; num = 4;}
if (b == 8) {a = "贝兹女王的荣耀之拳"; num = 9;}
if (b == 9) {a = "世事不可强求-快乐长存"; num = 10;}
if (b == 10) {a = "霍克莫特教务长"; num = 7;}
if (b == 11) {a = "先祖庇佑之柱"; num = 6;}
if (b == 12) {a = "威利：无限破坏者"; num = 8;}
if (b == 13) {a = "战神克星"; num = 4;}
if (b == 14) {a = "阴阳四天"; num = 4;}
if (b == 15) {a = "龙肝虎胆"; num = 4;}
if (b == 16) {a = "月影霜岚"; num = 4;}
if (b == 17) {a = "纵横百战"; num = 4;}
if (b == 18) {a = "代号N-神谕"; num = 6;}
if (b == 19) {a = "神王的闪电十字架"; num = 8;}
if (b == 20) {a = "星际毁灭"; num = 4;}
if (b == 21) {a = "辉煌耀世"; num = 4;}
if (b == 22) {a = "嗜战本能"; num = 4;}
if (b == 23) {a = "冰火清影"; num = 4;}
if (b == 24) {a = "离子驱逐者"; num = 5;}
if (b == 25) {a = "乌尔班工程巨炮"; num = 7;}
if (b == 26) {a = "永恒守护"; num = 4;}
if (b == 27) {a = "思维彼岸"; num = 4;}
if (b == 28) {a = "灵魂剥离"; num = 4;}
if (b == 29) {a = "无形魔链"; num = 4;}
if (b == 30) {a = "痛苦之渊"; num = 4;}
if (b == 31) {a = "妖刀村正"; num = 4;}
if (b == 32) {a = "黑月狼牙"; num = 4;}
}
if (qq > 3064 && qq <= 3163)
{
var b = irandom_range(1,9)
if (b == 1) {a = "启明星的指引"; num = 6;}
if (b == 2) {a = "氤氲之息"; num = 4;}
if (b == 3) {a = "清泉流响"; num = 4;}
if (b == 4) {a = "超级赛亚人的变身手镯"; num = 10;}
if (b == 5) {a = "碧水重门指环"; num = 6;}
if (b == 6) {a = "冥狱锁魂项链"; num = 6;}
if (b == 7) {a = "天空的里程碑-道阁三"; num = 10;}
if (b == 8) {a = "天空的灯塔-王良四"; num = 9;}
if (b == 9) {a = "天空的引路人-王良一"; num = 10;}
}
if (qq > 3163 && qq <= 3354)
{
var b = irandom_range(1,13)
if (b == 1) {a = "光电鳗的记忆"; num = 6;}
if (b == 2) {a = "杰克爆弹的记忆"; num = 7;}
if (b == 3) {a = "冰霜雪人的记忆"; num = 7;}
if (b == 4) {a = "暗影夜猫的记忆"; num = 7;}
if (b == 5) {a = "罗塞塔石碑"; num = 5;}
if (b == 6) {a = "英雄王的象征"; num = 6;}
if (b == 7) {a = "波利斯的黄金杯"; num = 7;}
if (b == 8) {a = "黑白境界-假面"; num = 7;}
if (b == 9) {a = "黑白境界-混沌"; num = 7;}
if (b == 10) {a = "黑白境界-灵魂"; num = 7;}
if (b == 11) {a = "非缄默之石"; num = 5;}
if (b == 12) {a = "鱼雕坠饰"; num = 4;}
if (b == 13) {a = "卡巴拉的记忆"; num = 6;}
}