
if (argument0 == "巨龙之怒-星空的征服者")
    return "\n/a  攻击时，增加20%真实伤害。\n  攻击时有5%的概率发动灼白之光，\n  日光灼烧所有的敌人，造成100%的真\n  实伤害，并且在15秒内增加20%的力量\n  。（冷却时间30秒）\n  攻击时有5%的概率发动星辰陨落，\n  召唤6颗流星，每颗造成300%的真\n  实伤害，并且在15秒内增加20%的智力\n  。（冷却时间30秒）"
if (argument0 == "屠戮者的镣铐")
    return "\n/a  撕裂斩提供智力和力量的持续时\n  间额外增加10秒。"
if (argument0 == "银河之星")
    return "\n/a  星狱·时轮剑的冷却时间－30％每\n  击杀一个目标，增加5％的星狱·时\n  轮剑的攻击力。（最多增加150％的\n  攻击力）"

if (argument0 == "永恒战术")
    return "\n/a  龙语剑术的攻击力＋100％\n  龙语剑术的冷却时间－80％"
    
if (argument0 == "倾塌之墙")
    return ""
    
if (argument0 == "维斯特卢")
    return "\n/a  死亡之刃的攻击力＋100％\n  死亡之刃的冷却时间－30％\n  死亡之刃对任何生命值的目标总是造成\n  最大伤害。"
    
if (argument0 == "毁灭之眼")
    return "\n/a  攻击时，以1％的概率刷新斩杀的\n  冷却时间。（冷却时间10秒）斩杀对\n  任何生命值的目标总是造成最大伤害。"
    
if (argument0 == "半巨人之怒")
    return "\n/a  每拥有10％的怒气值，增加5％的\n  技能攻击力。"
    
if (argument0 == "创世者柱石")
    return "\n/a  攻击时，以5％的概率发动雷电，造\n  成100％的真实伤害。攻击时，以5％\n  的概率发动山崩，造成100％的真实\n  伤害。攻击时，以5％的概率发动潮\n  汐，造成100％的真实伤害。攻击时\n  ，以5％的概率发动烈焰，造成100％\n  的真实伤害。"
    
if (argument0 == "诺萨的灵魂挽歌")
    return "\n/a  使用技能时，随机发动以下效果，持\n  续60秒。（冷却时间60秒）未实现\n  光明挽歌\n  -力量＋50％\n  -暴击率＋50％\n  黑暗挽歌\n  -智力＋50％\n  -命中率－50％\n  "
    
if (argument0 == "崇高的幻象")
    return "\n/a  幻影剑舞的攻击力＋50％\n  幻影剑舞的冷却时间－30％\n  幻影剑舞的斩击次数＋100％\n  幻影剑舞斩击时，自身处于无敌状态。"
    
if (argument0 == "时轮驾驭者")
    return "\n/a  星狱·时轮剑的攻击力－50％\n  星狱·时轮剑的冷却时间－50％ "
    
if (argument0 == "半巨人的背叛")
    return "\n/a  使用技能死亡之刃时，以20％的概\n  率增加100％的技能攻击力，持续8秒。"
    
if (argument0 == "维利的预言")
    return "\n/a  光影剑最大蓄力所需时间－100％\n  寂灭斩最大蓄力所需时间－100％\n  "
    
if (argument0 == "艾拉斯的轨迹")
    return "\n/a  影斩的攻击力＋500％\n  影斩的冷却时间－100％\n  瞬影破空斩的攻击力＋200％\n  瞬影破空斩的冷却时间－30％"
if (argument0 == "斯洛特的原初之力")
    return "\n/a  星狱·时轮剑会刷新所有技能的冷却时\n  间。（冷却时间120s） 未实现"




if (argument0 == "印记迷园")
    return "\n/a 「结晶预言者」施法不再需要法力值"
if (argument0 == "浮光花园")
    return "\n/a  施法时5%触发以下效果（持续30s）\n  -增加35%暴击率\n  增加20%防御力"
if (argument0 == "精灵天舞")
    return "\n/a 「回旋之鹰」攻击间隔-0.2秒\n 「回旋之影」冷却时间减少1秒"
if (argument0 == "伊贝拉的梦境")
    return "\n/a  卡莉莫的光之祈祷额外增加10%智力。\n  卡莉莫的暗之祈祷额外增加一个凋零。\n  卡莉莫的风之祈祷的飓风将会飞回。\n  卡莉莫的火之祈祷火焰会造成3段伤害\n 卡莉莫的冰之祈祷会使你无敌2秒\n  卡莉莫的雷之祈祷会使敌人进入感电\n  状态15秒。"
if (argument0 == "幸运的白兔")
    return "\n/a 「与英灵们的约定」伤害增加50%\n 「与英灵们的约定」冷却时间减少50%"
if (argument0 == "精灵之翼")
    return "\n/a 「元素风暴」法力最大消耗-90%\n 「元素风暴」伤害增加900%\n  重力减少75%\n  允许在空中施法。"
if (argument0 == "松之礼赞")
    return "\n/a  装备时生成元素环绕提供下列效果\n  -增加80点元素亲和度\n  -受到伤害时消耗等量的魔法抵挡50%\n  的伤害。"
if (argument0 == "夏夜星象馆")
    return "\n/a  对于「令人惊骇的百慕大三角」不\n  再发动「群星陨落」而是对于全部\n  技能都会追加一个陨星。"
if (argument0 == "月光漫步")
    return "\n/a 「无尽吞噬者」伤害增加35%\n 「无尽吞噬者」可以同时存在两只\n 「Devour Eidolon」攻击间隔-0.2s"
if (argument0 == "圣路易斯的轨迹")
    return "\n/a 「圣路易斯的冲天火柱」伤害+100%\n 「圣路易斯的冲天火柱」冷却时间+50s"
if (argument0 == "不动的大图书馆")
    return "\n/a 「无尽吞噬者」伤害+35%\n 「玛茜」伤害+35%\n 「玛茜」治疗量+100%\n 「结晶预言者」伤害+35%"
if (argument0 == "英雄王的象征")
    return "\n/a 「吉尔伽美什的王之宝库」在宝具\n  会产生爆炸造成500%法术伤害。"
if (argument0 == "幻想的狐嫁雨")
    return "\n/a  每20秒释放一次波与粒子的境界。"
if (argument0 == "怜月的约定")
    return "\n/a  生命值低于70%时，每7秒眩晕周围的怪\n  物0.5秒。\n  生命值低于50%时，每5秒眩晕周围的怪\n  物1秒。\n  生命值低于30%时，每3秒眩晕周围的怪\n  物1.5秒。"

if (argument0 == "艾露尼斯")
    return "\n/a  每20秒释放一次波与粒子的境界"
if (argument0 == "杰米尼-冥影之霍德尔")
    return "\n/a  每20秒释放一次波与粒子的境界"
if (argument0 == "艾因斯贝伦的诞生之芽")
    return "\n/a  每20秒释放一次波与粒子的境界"
return " "
